camel-message-router/src/test/soap/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rul="http://example.com/webservice/RuleExecutionService/">
    <soapenv:Header/>
    <soapenv:Body>
        <rul:execute>
            <ruleContext executionDate="2007-02-01T16:32:34.948Z">
                <ruleTargetName>land-parcel-validation-2016</ruleTargetName>
                <inputAttributes>
                    <name>APPLICATION_ID</name>
                    <value>11111</value>
                </inputAttributes>
                <inputAttributes>
                    <name>LAND_PARCEL_ID</name>
                    <value>2222222</value>
                </inputAttributes>
            </ruleContext>
        </rul:execute>
    </soapenv:Body>
</soapenv:Envelope>